    01 Operation pic 9999 value zero.
        88 OperationIsExit value F10.
        88 OperationIsSave value F8.
        88 OperationIsAdd  value F3.
        88 OperationIsView value F2.
        88 OperationIsEdit value F4.
        88 OperationIsTogglePaid value F7.
        88 OperationIsToggleStatus value F6.
        88 OperationIsToggleArrivalDay value F5.
        88 OperationIsBack values F1 ESC.
        88 OperationIsFinish value 0000.
